Revit 2024 API
ParameterMap.ForwardIterator Method
Retrieve a forward moving iterator to the map.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual ParameterMapIterator ForwardIterator()
Visual Basic
Public Overridable Function ForwardIterator As ParameterMapIterator
Visual C++
public:
virtual ParameterMapIterator^ ForwardIterator()
Return Value
Returns a forward moving iterator to the map.
See Also
ParameterMap Class
Autodesk.Revit.DB Namespace